# №1 Створіть змінну name та привласніть їй ваше ім'я, наприклад 'Данило' Створіть змінну age і надайте їй значення свого віку
name = 'Данило'
age = 42

# №2 Нехай нам необхідно розрахувати послуги споживання електрики. У змінній rate у нас знаходиться тариф за електроенергію 1.68, а в змінній value — значення показання лічильника, задайте для неї розумне ціле число в кіловатах. Розрахуйте та помістіть у змінну payment рахунок за електрику.
rate = 1.68
value = 50
payment = rate * value

# №3 Повернемося до попереднього завдання. У змінній rate у нас знаходиться тариф за електроенергію — 1.68. Але тепер нам потрібно вести розрахунок денного та нічного тарифу. Нічний тариф розраховується як половина денного, тобто. rate треба поділити на 2. У змінній value_day — денні показання лічильника, а в змінній value_night — нічні. Знову ж таки, задайте для них розумне ціле число кіловат. Розрахуйте та помістіть у змінну payment рахунок за електрику, але вже з урахуванням денного та нічного тарифів.
rate = 1.68
value_day = 50
value_night = 20
payment = (value_day * rate) + (value_night * (rate/2))

# №4 Знову повернемося до попереднього завдання. Додамо перед обчисленням змінної payment пояснювальний коментар. Закоментуйте текст 'Payment for electricity for the current month', щоб код став робочим.
rate = 1.68
value_day = 358
value_night = 103
# Payment for electricity for the current month
payment = rate * value_day + rate / 2 * value_night

# №5 При покупці квитків нам завжди необхідно знати ім'я та прізвище покупця. Оголосимо дві рядкові змінні: first_name, яка містить ім'я, та змінну last_name, в яку помістимо прізвище користувача. Створіть ці дві змінні та привласніть їм своє ім'я та прізвище.
first_name = 'Taras'
last_name = 'Sabat'
